krishnakumar4a4/esp8266-twitter/oauth.h
#include <ESP8266WiFi.h>
#include <WiFiClientSecure.h>
#include <NTPClient.h>
#include <WiFiUdp.h>
#include <TimeLib.h>
#include <stdint.h>
#include <NTPClient.h>
#include <time.h>
#include <vector>
#include <string>
#include <algorithm>

class misc
{
private:
  static void url_encode_(const char *ptr, const char *end, std::vector<char> *out)
  {
    while (ptr < end)
    {
      int c = (unsigned char)*ptr;
      ptr++;
      if (isalnum(c) || strchr("_.-~", c))
      {
        print(out, c);
      }
      else
      {
        char tmp[10];
        sprintf(tmp, "%%%02X", c);
        print(out, tmp[0]);
        print(out, tmp[1]);
        print(out, tmp[2]);
      }
    }
  }
  static void url_decode_(const char *ptr, const char *end, std::vector<char> *out)
  {
    while (ptr < end)
    {
      int c = (unsigned char)*ptr;
      ptr++;
      if (c == '+')
      {
        c = ' ';
      }
      else if (c == '%' && isxdigit((unsigned char)ptr[0]) && isxdigit((unsigned char)ptr[1]))
      {
        char tmp[3]; // '%XX'
        tmp[0] = ptr[0];
        tmp[1] = ptr[1];
        tmp[2] = 0;
        c = strtol(tmp, NULL, 16);
        ptr += 2;
      }
      print(out, c);
    }
  }

public:
  static void print(std::vector<char> *out, char c)
  {
    out->push_back(c);
  }
  static void print(std::vector<char> *out, char const *begin, char const *end)
  {
    out->insert(out->end(), begin, end);
  }
  static void print(std::vector<char> *out, char const *ptr, size_t len)
  {
    print(out, ptr, ptr + len);
  }
  static void print(std::vector<char> *out, char const *s)
  {
    print(out, s, s + strlen(s));
  }
  static void print(std::vector<char> *out, std::string const &s)
  {
    print(out, s.c_str(), s.size());
  }
  static std::string to_stdstr(std::vector<char> const &vec)
  {
    if (!vec.empty())
    {
      char const *begin = &vec.at(0);
      char const *end = begin + vec.size();
      return std::string(begin, end);
    }
    return std::string();
  }

  static std::string url_encode(char const *str, char const *end)
  {
    if (!str)
    {
      return std::string();
    }

    std::vector<char> out;
    out.reserve(end - str + 10);

    url_encode_(str, end, &out);

    return to_stdstr(out);
  }
  static std::string url_decode(char const *str, char const *end)
  {
    if (!str)
    {
      return std::string();
    }

    std::vector<char> out;
    out.reserve(end - str + 10);

    url_decode_(str, end, &out);

    return to_stdstr(out);
  }

  static std::string url_encode(char const *str, size_t len)
  {
    return url_encode(str, str + len);
  }
  static std::string url_decode(char const *str, size_t len)
  {
    return url_decode(str, str + len);
  }

  static std::string url_encode(char const *str)
  {
    return url_encode(str, strlen(str));
  }
  static std::string url_decode(const char *str)
  {
    return url_decode(str, strlen(str));
  }

  static std::string url_encode(std::string const &str)
  {
    char const *begin = str.c_str();
    char const *end = begin + str.size();
    char const *ptr = begin;

    while (ptr < end)
    {
      int c = (unsigned char)*ptr;
      if (isalnum(c) || strchr("_.-~", c))
      {
      }
      else
      {
        break;
      }
      ptr++;
    }
    if (ptr == end)
    {
      return str;
    }

    std::vector<char> out;
    out.reserve(str.size() + 10);

    out.insert(out.end(), begin, ptr);
    url_encode_(ptr, end, &out);

    return to_stdstr(out);
  }
  static std::string url_decode(std::string const &str)
  {
    char const *begin = str.c_str();
    char const *end = begin + str.size();
    char const *ptr = begin;

    while (ptr < end)
    {
      int c = *ptr & 0xff;
      if (c == '+' || c == '%')
      {
        break;
      }
      ptr++;
    }
    if (ptr == end)
    {
      return str;
    }

    std::vector<char> out;
    out.reserve(str.size() + 10);

    out.insert(out.end(), begin, ptr);
    url_decode_(ptr, end, &out);

    return to_stdstr(out);
  }
};

class base64
{
private:
  static const unsigned char PAD = '=';
  static unsigned char enc(int c)
  {
    static const unsigned char _encode_table[] = {
        0x41,
        0x42,
        0x43,
        0x44,
        0x45,
        0x46,
        0x47,
        0x48,
        0x49,
        0x4a,
        0x4b,
        0x4c,
        0x4d,
        0x4e,
        0x4f,
        0x50,
        0x51,
        0x52,
        0x53,
        0x54,
        0x55,
        0x56,
        0x57,
        0x58,
        0x59,
        0x5a,
        0x61,
        0x62,
        0x63,
        0x64,
        0x65,
        0x66,
        0x67,
        0x68,
        0x69,
        0x6a,
        0x6b,
        0x6c,
        0x6d,
        0x6e,
        0x6f,
        0x70,
        0x71,
        0x72,
        0x73,
        0x74,
        0x75,
        0x76,
        0x77,
        0x78,
        0x79,
        0x7a,
        0x30,
        0x31,
        0x32,
        0x33,
        0x34,
        0x35,
        0x36,
        0x37,
        0x38,
        0x39,
        0x2b,
        0x2f,
    };
    return _encode_table[c & 63];
  }
  static unsigned char dec(int c)
  {
    static const unsigned char _decode_table[] = {
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0x3e,
        0xff,
        0xff,
        0xff,
        0x3f,
        0x34,
        0x35,
        0x36,
        0x37,
        0x38,
        0x39,
        0x3a,
        0x3b,
        0x3c,
        0x3d,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0x00,
        0x01,
        0x02,
        0x03,
        0x04,
        0x05,
        0x06,
        0x07,
        0x08,
        0x09,
        0x0a,
        0x0b,
        0x0c,
        0x0d,
        0x0e,
        0x0f,
        0x10,
        0x11,
        0x12,
        0x13,
        0x14,
        0x15,
        0x16,
        0x17,
        0x18,
        0x19,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
        0x1a,
        0x1b,
        0x1c,
        0x1d,
        0x1e,
        0x1f,
        0x20,
        0x21,
        0x22,
        0x23,
        0x24,
        0x25,
        0x26,
        0x27,
        0x28,
        0x29,
        0x2a,
        0x2b,
        0x2c,
        0x2d,
        0x2e,
        0x2f,
        0x30,
        0x31,
        0x32,
        0x33,
        0xff,
        0xff,
        0xff,
        0xff,
        0xff,
    };
    return _decode_table[c & 127];
  }

