krishnakumar4a4/esp8266-twitter/oauth.h
public:
  static void encode(char const *src, size_t length, std::vector<char> *out)
  {
    size_t srcpos, dstlen, dstpos;

    dstlen = (length + 2) / 3 * 4;
    out->resize(dstlen);
    if (dstlen == 0)
    {
      return;
    }
    char *dst = &out->at(0);
    dstpos = 0;
    for (srcpos = 0; srcpos < length; srcpos += 3)
    {
      int v = (unsigned char)src[srcpos] << 16;
      if (srcpos + 1 < length)
      {
        v |= (unsigned char)src[srcpos + 1] << 8;
        if (srcpos + 2 < length)
        {
          v |= (unsigned char)src[srcpos + 2];
          dst[dstpos + 3] = enc(v);
        }
        else
        {
          dst[dstpos + 3] = PAD;
        }
        dst[dstpos + 2] = enc(v >> 6);
      }
      else
      {
        dst[dstpos + 2] = PAD;
        dst[dstpos + 3] = PAD;
      }
      dst[dstpos + 1] = enc(v >> 12);
      dst[dstpos] = enc(v >> 18);
      dstpos += 4;
    }
  }
  static void decode(char const *src, size_t length, std::vector<char> *out)
  {
    unsigned char const *begin = (unsigned char const *)src;
    unsigned char const *end = begin + length;
    unsigned char const *ptr = begin;
    out->clear();
    out->reserve(length * 3 / 4);
    int count = 0;
    int bits = 0;
    while (1)
    {
      if (isspace(*ptr))
      {
        ptr++;
      }
      else
      {
        unsigned char c = 0xff;
        if (ptr < end && *ptr < 0x80)
        {
          c = dec(*ptr);
        }
        if (c < 0x40)
        {
          bits = (bits << 6) | c;
          count++;
        }
        else
        {
          if (count < 4)
          {
            bits <<= (4 - count) * 6;
          }
          c = 0xff;
        }
        if (count == 4 || c == 0xff)
        {
          if (count >= 2)
          {
            out->push_back(bits >> 16);
            if (count >= 3)
            {
              out->push_back(bits >> 8);
              if (count == 4)
              {
                out->push_back(bits);
              }
            }
          }
          count = 0;
          bits = 0;
          if (c == 0xff)
          {
            break;
          }
        }
        ptr++;
      }
    }
  }
  static void encode(std::vector<char> const *src, std::vector<char> *out)
  {
    encode(&src->at(0), src->size(), out);
  }
  static void decode(std::vector<char> const *src, std::vector<char> *out)
  {
    decode(&src->at(0), src->size(), out);
  }
  static void encode(char const *src, std::vector<char> *out)
  {
    encode((char const *)src, strlen(src), out);
  }
  static void decode(char const *src, std::vector<char> *out)
  {
    decode((char const *)src, strlen(src), out);
  }
  static inline std::string to_s_(std::vector<char> const *vec)
  {
    if (!vec || vec->empty())
      return std::string();
    return std::string((char const *)&(*vec)[0], vec->size());
  }
  static inline std::string encode(std::string const &src)
  {
    std::vector<char> vec;
    encode((char const *)src.c_str(), src.size(), &vec);
    return to_s_(&vec);
  }
  static inline std::string decode(std::string const &src)
  {
    std::vector<char> vec;
    decode((char const *)src.c_str(), src.size(), &vec);
    return to_s_(&vec);
  }
};

class sha1
{
public:
  enum
  {
    Success = 0,
    Null,         /* Null pointer parameter */
    InputTooLong, /* input data too long */
    StateError    /* called Input after Result */
  };

public:
  static const int HashSize = 20;
  struct Context
  {
    uint32_t Intermediate_Hash[HashSize / 4]; /* Message Digest  */

    uint32_t Length_Low;  /* Message length in bits      */
    uint32_t Length_High; /* Message length in bits      */

    /* Index into message block array   */
    int_least16_t Message_Block_Index;
    uint8_t Message_Block[64]; /* 512-bit message blocks      */

    int Computed;  /* Is the digest computed?         */
    int Corrupted; /* Is the message digest corrupted? */
  };
  static uint32_t CircularShift(uint32_t bits, uint32_t word)
  {
    return ((word) << (bits)) | ((word) >> (32 - (bits)));
  }
  static void PadMessage(Context *context)
  {
    if (context->Message_Block_Index > 55)
    {
      context->Message_Block[context->Message_Block_Index++] = 0x80;
      while (context->Message_Block_Index < 64)
      {
        context->Message_Block[context->Message_Block_Index++] = 0;
      }

      ProcessMessageBlock(context);

      while (context->Message_Block_Index < 56)
      {
        context->Message_Block[context->Message_Block_Index++] = 0;
      }
    }
    else
    {
      context->Message_Block[context->Message_Block_Index++] = 0x80;
      while (context->Message_Block_Index < 56)
      {
        context->Message_Block[context->Message_Block_Index++] = 0;
      }
    }

    context->Message_Block[56] = context->Length_High >> 24;
    context->Message_Block[57] = context->Length_High >> 16;
    context->Message_Block[58] = context->Length_High >> 8;
    context->Message_Block[59] = context->Length_High;
    context->Message_Block[60] = context->Length_Low >> 24;
    context->Message_Block[61] = context->Length_Low >> 16;
    context->Message_Block[62] = context->Length_Low >> 8;
    context->Message_Block[63] = context->Length_Low;

    ProcessMessageBlock(context);
  }
  static void ProcessMessageBlock(Context *context)
  {
    const uint32_t K[] = {
        0x5A827999,
        0x6ED9EBA1,
        0x8F1BBCDC,
        0xCA62C1D6};
    int t;
    uint32_t temp;
    uint32_t W[80];
    uint32_t A, B, C, D, E;

    for (t = 0; t < 16; t++)
    {
      W[t] = context->Message_Block[t * 4] << 24;
      W[t] |= context->Message_Block[t * 4 + 1] << 16;
      W[t] |= context->Message_Block[t * 4 + 2] << 8;
      W[t] |= context->Message_Block[t * 4 + 3];
    }

    for (t = 16; t < 80; t++)
    {
      W[t] = CircularShift(1, W[t - 3] ^ W[t - 8] ^ W[t - 14] ^ W[t - 16]);
    }

    A = context->Intermediate_Hash[0];
    B = context->Intermediate_Hash[1];
    C = context->Intermediate_Hash[2];
    D = context->Intermediate_Hash[3];
    E = context->Intermediate_Hash[4];

