krishnakumar4a4/esp8266-twitter/oauth.h
    for (t = 0; t < 20; t++)
    {
      temp = CircularShift(5, A) + ((B & C) | ((~B) & D)) + E + W[t] + K[0];
      E = D;
      D = C;
      C = CircularShift(30, B);
      B = A;
      A = temp;
    }

    for (t = 20; t < 40; t++)
    {
      temp = CircularShift(5, A) + (B ^ C ^ D) + E + W[t] + K[1];
      E = D;
      D = C;
      C = CircularShift(30, B);
      B = A;
      A = temp;
    }

    for (t = 40; t < 60; t++)
    {
      temp = CircularShift(5, A) + ((B & C) | (B & D) | (C & D)) + E + W[t] + K[2];
      E = D;
      D = C;
      C = CircularShift(30, B);
      B = A;
      A = temp;
    }

    for (t = 60; t < 80; t++)
    {
      temp = CircularShift(5, A) + (B ^ C ^ D) + E + W[t] + K[3];
      E = D;
      D = C;
      C = CircularShift(30, B);
      B = A;
      A = temp;
    }

    context->Intermediate_Hash[0] += A;
    context->Intermediate_Hash[1] += B;
    context->Intermediate_Hash[2] += C;
    context->Intermediate_Hash[3] += D;
    context->Intermediate_Hash[4] += E;

    context->Message_Block_Index = 0;
  }

public:
  static int Reset(Context *context)
  {
    if (!context)
    {
      return Null;
    }

    context->Length_Low = 0;
    context->Length_High = 0;
    context->Message_Block_Index = 0;

    context->Intermediate_Hash[0] = 0x67452301;
    context->Intermediate_Hash[1] = 0xEFCDAB89;
    context->Intermediate_Hash[2] = 0x98BADCFE;
    context->Intermediate_Hash[3] = 0x10325476;
    context->Intermediate_Hash[4] = 0xC3D2E1F0;

    context->Computed = 0;
    context->Corrupted = 0;

    return Success;
  }
  static int Result(Context *context, uint8_t Message_Digest[])
  {
    int i;

    if (!context || !Message_Digest)
    {
      return Null;
    }

    if (context->Corrupted)
    {
      return context->Corrupted;
    }

    if (!context->Computed)
    {
      PadMessage(context);
      for (i = 0; i < 64; ++i)
      {
        /* message may be sensitive, clear it out */
        context->Message_Block[i] = 0;
      }
      context->Length_Low = 0; /* and clear length */
      context->Length_High = 0;
      context->Computed = 1;
    }

    for (i = 0; i < HashSize; ++i)
    {
      Message_Digest[i] = context->Intermediate_Hash[i >> 2] >> 8 * (3 - (i & 0x03));
    }

    return Success;
  }
  static int Input(Context *context, const uint8_t *message_array, unsigned int length)
  {
    if (!length)
    {
      return Success;
    }

    if (!context || !message_array)
    {
      return Null;
    }

    if (context->Computed)
    {
      context->Corrupted = StateError;
      return StateError;
    }

    if (context->Corrupted)
    {
      return context->Corrupted;
    }
    while (length-- && !context->Corrupted)
    {
      context->Message_Block[context->Message_Block_Index++] = (*message_array & 0xFF);

      context->Length_Low += 8;
      if (context->Length_Low == 0)
      {
        context->Length_High++;
        if (context->Length_High == 0)
        {
          /* Message is too long */
          context->Corrupted = 1;
        }
      }

      if (context->Message_Block_Index == 64)
      {
        ProcessMessageBlock(context);
      }

      message_array++;
    }

    return Success;
  }
};


class oauth
{
public:
  class Keys
  {
  public:
    std::string consumer_key;
    std::string consumer_sec;
    std::string accesstoken;
    std::string accesstoken_sec;

    Keys()
    {
    }

    Keys(std::string consumer_key, std::string consumer_sec, std::string accesstoken, std::string accesstoken_sec)
        : consumer_key(consumer_key), consumer_sec(consumer_sec), accesstoken(accesstoken), accesstoken_sec(accesstoken_sec)
    {
    }
  };
  enum http_method_t
  {
    GET,
    POST,
  };
  struct Request
  {
    std::string url;
    std::string post;
    std::string getdata;
    std::string right;
  };
  static Request sign(const char *url, http_method_t http_method, Keys const &keys, time_t currentTime)
  {
    std::vector<std::string> vec;
    split_url(url, &vec);

    process_(&vec, http_method, keys, currentTime);

    if (http_method == POST)
    {
      Request req;
      req.post = oauth::build_url_with_quotes(vec, 1);
      Serial.print("req.post: ");
      Serial.println(req.post.c_str());
      req.url = vec.at(0);
      return req;
    }
    else if (http_method == GET)
    {
      Request req;
      //      req.timevalue = currentTime;
      Serial.println("sign started");
      // req.getdata = oauth::build_oauth_auth(vec, 1);
      req.getdata = oauth::build_url_with_quotes(vec, 1);
      Serial.print("sign getdata: ");
      Serial.println(req.getdata.c_str());
      req.right = oauth::split_url_right(url);
      Serial.print("sign right: ");
      Serial.println(req.right.c_str());
      req.url = vec.at(0);
      Serial.print("sign url: ");
      Serial.println(req.url.c_str());
      return req;
    }
    else
    {
      Request req;
      req.url = oauth::build_url(vec, 0);
      return req;
    }
  }

private:
  static std::string encode_base64(const unsigned char *src, int size)
  {
    std::vector<char> vec;
    base64::encode((char const *)src, size, &vec);
    return misc::to_stdstr(vec);
  }
  static std::string decode_base64(const char *src)
  {
    std::vector<char> vec;
    base64::decode(src, &vec);
    return misc::to_stdstr(vec);
  }
  static std::string url_escape(const char *string)
  {
    return misc::url_encode(string);
  }
  static std::string url_unescape(const char *string)
  {
    return misc::url_decode(string);
  }
  static void process_(std::vector<std::string> *args, http_method_t http_method, const Keys &keys, time_t timevalue)
  {
    auto to_s = [](int v) -> std::string
    {
      char tmp[100];
      sprintf(tmp, "%d", v);
      return tmp;
    };

    {
      auto nonce = [](time_t timevalue)
      {
        static const char *chars = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789_";
        const unsigned int max = 26 + 26 + 10 + 1;
        char tmp[50];
        srand((unsigned int)timevalue);
        // int len = 15 + rand() % 16;
        int len = 42; // New twitter API requires 42 characters
        for (int i = 0; i < len; i++)
        {
          tmp[i] = chars[rand() % max];
        }
        return std::string(tmp, len);
      };

